깊이 우선 탐색(Depth-First Search, DFS)은 그래프 탐색 알고리즘 중 하나로, 시작 정점에서 출발하여 그래프의 한 방향으로 깊이 들어갔다가 다시 돌아와 다른 방향으로 깊이 들어가는 방식으로 탐색을 수행하는 알고리즘입니다. DFS는 스택(Stack) 또는 재귀 함수(Recursive Function)를 사용하여 구현할 수 있습니다.

DFS 알고리즘의 동작 과정은 다음과 같습니다.

1. 시작 정점을 스택에 넣고, 방문 처리를 합니다.
2. 스택의 최상단(맨 위) 정점을 꺼냅니다. (스택에서 꺼낸 정점을 현재 정점으로 간주합니다.)
3. 현재 정점의 인접 정점들을 확인합니다.
    - 인접 정점이 방문하지 않은 상태라면, 해당 정점을 스택에 넣고 방문 처리합니다. 그리고 현재 정점을 인접 정점으로 변경하고 3번 과정을 반복합니다.
    - 인접 정점이 모두 방문한 상태라면, 스택에서 현재 정점을 제거하고 이전 정점으로 돌아갑니다.
4. 스택이 빌 때까지 2~3 단계를 반복합니다.

아래에는 Python으로 구현한 DFS 알고리즘 예시가 있습니다.

```python
graph = {
    'A': ['B', 'C'],
    'B': ['A', 'D', 'E'],
    'C': ['A', 'F'],
    'D': ['B'],
    'E': ['B', 'F'],
    'F': ['C', 'E']
}

visited = set()

def dfs(graph, node, visited):
    if node not in visited:
        print(node, end=' ')
        visited.add(node)
        for neighbor in graph[node]:
            dfs(graph, neighbor, visited)

dfs(graph, 'A', visited)

```

위 코드에서는 그래프를 딕셔너리로 표현하였으며, **`visited`** 집합을 사용하여 방문한 정점을 기록합니다. 재귀 함수를 사용하여 현재 정점의 인접 정점을 방문하고, 더 이상 방문할 인접 정점이 없을 경우 함수 호출이 종료되면서 이전 정점으로 돌아갑니다. 이렇게 DFS를 사용하면 시작 정점에서부터 깊이 들어가며 탐색을 수행하게 됩니다.
